; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v8 ?v10)
             (pred_7 ?v2 ?v6)
             (pred_5 ?v8 ?v6)
             (pred_2 ?v9 ?v8 )
	     (pred_8 ?v8)
             (pred_1 ?v13)
             (pred_3 ?v2)
             (pred_4 ?v6)
             (pred_12 ?v8)
             (pred_11 ?v2)
             (pred_6 ?v8)
             (pred_9 ))



(:action op_3
:parameters (?v5 ?v11 ?v1 ?v3)
:precondition (and (pred_1 ?v5) (pred_1 ?v11) (pred_3 ?v1) (pred_4 ?v3)
          (pred_10 ?v5 ?v11) (pred_7 ?v1 ?v3)
                   (pred_5 ?v11 ?v3) (pred_8 ?v5) 
                   (pred_12 ?v11) (pred_11 ?v1))
:effect (and  (pred_6 ?v11) (not (pred_12 ?v11))))


(:action op_2
:parameters (?v5 ?v7)
:precondition (and (pred_1 ?v5) (pred_1 ?v7)
               (pred_8 ?v5) (pred_10 ?v5 ?v7) (pred_6 ?v7))
:effect (and (pred_8 ?v7) (not (pred_8 ?v5))))

(:action op_5
:parameters (?v5 ?v1)
:precondition (and (pred_1 ?v5) (pred_3 ?v1) 
                  (pred_8 ?v5) (pred_2 ?v1 ?v5) (pred_9 ))
:effect (and (pred_11 ?v1)
   (not (pred_2 ?v1 ?v5)) (not (pred_9 ))))


(:action op_4
:parameters (?v5 ?v4 ?v12)
:precondition (and (pred_1 ?v5) (pred_3 ?v4) (pred_3 ?v12)
                  (pred_8 ?v5) (pred_11 ?v12) (pred_2 ?v4 ?v5))
:effect (and (pred_11 ?v4) (pred_2 ?v12 ?v5)
        (not (pred_11 ?v12)) (not (pred_2 ?v4 ?v5))))

(:action op_1
:parameters (?v5 ?v1)
:precondition (and (pred_1 ?v5) (pred_3 ?v1) 
                  (pred_8 ?v5) (pred_11 ?v1))
:effect (and (pred_9 ) (pred_2 ?v1 ?v5) (not (pred_11 ?v1)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_07 obj_06 obj_28 obj_16 obj_26 obj_11 obj_19 obj_20 obj_23 obj_10 obj_03 obj_13 obj_24 obj_27 obj_21 obj_30 obj_04 obj_15 obj_18 obj_09 obj_02 obj_01 obj_22 obj_08 obj_17
    obj_14 obj_05
    obj_29 obj_12 obj_25
    )

    (:init
       (pred_9)

       (pred_1 obj_07)
       (pred_1 obj_06)
       (pred_1 obj_28)
       (pred_1 obj_16)
       (pred_1 obj_26)
       (pred_1 obj_11)
       (pred_1 obj_19)
       (pred_1 obj_20)
       (pred_1 obj_23)
       (pred_1 obj_10)
       (pred_1 obj_03)
       (pred_1 obj_13)
       (pred_1 obj_24)
       (pred_1 obj_27)
       (pred_1 obj_21)
       (pred_1 obj_30)
       (pred_1 obj_04)
       (pred_1 obj_15)
       (pred_1 obj_18)
       (pred_1 obj_09)
       (pred_1 obj_02)
       (pred_1 obj_01)
       (pred_1 obj_22)
       (pred_1 obj_08)
       (pred_1 obj_17)
       (pred_4 obj_14)
       (pred_4 obj_05)
       (pred_3 obj_29)
       (pred_3 obj_12)
       (pred_3 obj_25)

       (pred_10 obj_07 obj_11)
       (pred_10 obj_07 obj_06)
       (pred_10 obj_06 obj_19)
       (pred_10 obj_06 obj_28)
       (pred_10 obj_06 obj_07)
       (pred_10 obj_28 obj_20)
       (pred_10 obj_28 obj_16)
       (pred_10 obj_28 obj_06)
       (pred_10 obj_16 obj_23)
       (pred_10 obj_16 obj_26)
       (pred_10 obj_16 obj_28)
       (pred_10 obj_26 obj_10)
       (pred_10 obj_26 obj_16)
       (pred_10 obj_11 obj_03)
       (pred_10 obj_11 obj_19)
       (pred_10 obj_11 obj_07)
       (pred_10 obj_19 obj_13)
       (pred_10 obj_19 obj_20)
       (pred_10 obj_19 obj_06)
       (pred_10 obj_19 obj_11)
       (pred_10 obj_20 obj_24)
       (pred_10 obj_20 obj_23)
       (pred_10 obj_20 obj_28)
       (pred_10 obj_20 obj_19)
       (pred_10 obj_23 obj_27)
       (pred_10 obj_23 obj_10)
       (pred_10 obj_23 obj_16)
       (pred_10 obj_23 obj_20)
       (pred_10 obj_10 obj_21)
       (pred_10 obj_10 obj_26)
       (pred_10 obj_10 obj_23)
       (pred_10 obj_03 obj_30)
       (pred_10 obj_03 obj_13)
       (pred_10 obj_03 obj_11)
       (pred_10 obj_13 obj_04)
       (pred_10 obj_13 obj_24)
       (pred_10 obj_13 obj_19)
       (pred_10 obj_13 obj_03)
       (pred_10 obj_24 obj_15)
       (pred_10 obj_24 obj_27)
       (pred_10 obj_24 obj_20)
       (pred_10 obj_24 obj_13)
       (pred_10 obj_27 obj_18)
       (pred_10 obj_27 obj_21)
       (pred_10 obj_27 obj_23)
       (pred_10 obj_27 obj_24)
       (pred_10 obj_21 obj_09)
       (pred_10 obj_21 obj_10)
       (pred_10 obj_21 obj_27)
       (pred_10 obj_30 obj_02)
       (pred_10 obj_30 obj_04)
       (pred_10 obj_30 obj_03)
       (pred_10 obj_04 obj_01)
       (pred_10 obj_04 obj_15)
       (pred_10 obj_04 obj_13)
       (pred_10 obj_04 obj_30)
       (pred_10 obj_15 obj_22)
       (pred_10 obj_15 obj_18)
       (pred_10 obj_15 obj_24)
       (pred_10 obj_15 obj_04)
       (pred_10 obj_18 obj_08)
       (pred_10 obj_18 obj_09)
       (pred_10 obj_18 obj_27)
       (pred_10 obj_18 obj_15)
       (pred_10 obj_09 obj_17)
       (pred_10 obj_09 obj_21)
       (pred_10 obj_09 obj_18)
       (pred_10 obj_02 obj_01)
       (pred_10 obj_02 obj_30)
       (pred_10 obj_01 obj_22)
       (pred_10 obj_01 obj_04)
       (pred_10 obj_01 obj_02)
       (pred_10 obj_22 obj_08)
       (pred_10 obj_22 obj_15)
       (pred_10 obj_22 obj_01)
       (pred_10 obj_08 obj_17)
       (pred_10 obj_08 obj_18)
       (pred_10 obj_08 obj_22)
       (pred_10 obj_17 obj_09)
       (pred_10 obj_17 obj_08)
       (pred_12 obj_02)
       (pred_12 obj_20)
       (pred_12 obj_26)
       (pred_5  obj_02 obj_14)
       (pred_5  obj_20 obj_05)
       (pred_5  obj_26 obj_05)
       (pred_6 obj_07)
       (pred_6 obj_06)
       (pred_6 obj_28)
       (pred_6 obj_16)
       (pred_6 obj_11)
       (pred_6 obj_19)
       (pred_6 obj_23)
       (pred_6 obj_10)
       (pred_6 obj_03)
       (pred_6 obj_13)
       (pred_6 obj_24)
       (pred_6 obj_27)
       (pred_6 obj_21)
       (pred_6 obj_30)
       (pred_6 obj_04)
       (pred_6 obj_15)
       (pred_6 obj_18)
       (pred_6 obj_09)
       (pred_6 obj_01)
       (pred_6 obj_22)
       (pred_6 obj_08)
       (pred_6 obj_17)

       (pred_7  obj_29 obj_14)
       (pred_7  obj_12 obj_05)
       (pred_7  obj_25 obj_14)
       (pred_2 obj_29 obj_30)
       (pred_2 obj_12 obj_24)
       (pred_2 obj_25 obj_30)
       (pred_8 obj_24)
    )

    (:goal (and
       (pred_2 obj_29 obj_17)
       (pred_2 obj_12 obj_03)
       (pred_2 obj_25 obj_27)
    ))
(:constraints
  (always (not (pred_8 obj_18)))
)
)

; plan
1. (op_5 obj_24 obj_12)
   deleted: (pred_2 obj_12 obj_24) (pred_9)
   added: (pred_11 obj_12)
   goals met: 0 of 3
2. (op_2 obj_24 obj_13)
   deleted: (pred_8 obj_24)
   added: (pred_8 obj_13)
   goals met: 0 of 3
3. (op_2 obj_13 obj_03)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_03)
   goals met: 0 of 3
4. (op_1 obj_03 obj_12)
   deleted: (pred_11 obj_12)
   added: (pred_9) (pred_2 obj_12 obj_03)
   goals met: 1 of 3
5. (op_2 obj_03 obj_30)
   deleted: (pred_8 obj_03)
   added: (pred_8 obj_30)
   goals met: 1 of 3
6. (op_5 obj_30 obj_25)
   deleted: (pred_2 obj_25 obj_30) (pred_9)
   added: (pred_11 obj_25)
   goals met: 1 of 3
7. (op_2 obj_30 obj_03)
   deleted: (pred_8 obj_30)
   added: (pred_8 obj_03)
   goals met: 1 of 3
8. (op_2 obj_03 obj_13)
   deleted: (pred_8 obj_03)
   added: (pred_8 obj_13)
   goals met: 1 of 3
9. (op_2 obj_13 obj_24)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_24)
   goals met: 1 of 3
10. (op_2 obj_24 obj_27)
   deleted: (pred_8 obj_24)
   added: (pred_8 obj_27)
   goals met: 1 of 3
11. (op_1 obj_27 obj_25)
   deleted: (pred_11 obj_25)
   added: (pred_9) (pred_2 obj_25 obj_27)
   goals met: 2 of 3
12. (op_2 obj_27 obj_24)
   deleted: (pred_8 obj_27)
   added: (pred_8 obj_24)
   goals met: 2 of 3
13. (op_2 obj_24 obj_15)
   deleted: (pred_8 obj_24)
   added: (pred_8 obj_15)
   goals met: 2 of 3
14. (op_2 obj_15 obj_04)
   deleted: (pred_8 obj_15)
   added: (pred_8 obj_04)
   goals met: 2 of 3
15. (op_2 obj_04 obj_30)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_30)
   goals met: 2 of 3
16. (op_5 obj_30 obj_29)
   deleted: (pred_2 obj_29 obj_30) (pred_9)
   added: (pred_11 obj_29)
   goals met: 2 of 3
17. (op_2 obj_30 obj_04)
   deleted: (pred_8 obj_30)
   added: (pred_8 obj_04)
   goals met: 2 of 3
18. (op_2 obj_04 obj_15)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_15)
   goals met: 2 of 3
19. (op_2 obj_15 obj_22)
   deleted: (pred_8 obj_15)
   added: (pred_8 obj_22)
   goals met: 2 of 3
20. (op_2 obj_22 obj_08)
   deleted: (pred_8 obj_22)
   added: (pred_8 obj_08)
   goals met: 2 of 3
21. (op_2 obj_08 obj_17)
   deleted: (pred_8 obj_08)
   added: (pred_8 obj_17)
   goals met: 2 of 3
22. (op_1 obj_17 obj_29)
   deleted: (pred_11 obj_29)
   added: (pred_9) (pred_2 obj_29 obj_17)
   goals met: 3 of 3
